# ViewNode Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewNode Class
Members See Also
---
A render node that represents a view.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public class ViewNode : RenderNode
```

Visual Basic
---
```text
Public Class ViewNode _
	Inherits RenderNode
```

Visual C++
---
```text
public ref class ViewNode : public RenderNode
```

# Remarks
See also: [!:Autodesk::Revit::DB::IExportContext::OnViewBegin].
# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..RenderNode Autodesk.Revit.DB..::..ViewNode
# See Also
ViewNode Members
Autodesk.Revit.DB Namespace